Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW.TopWebFillet
Top Web Fillet - fillet radius at the top of web.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW.FlangeFillet
Flange Fillet - fillet radius at the flange end.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Angle shape.
width:
Section width.
height:
Section height, depth.
flangeThickness:
Flange Thickness.
webThickness:
Web Thickness.
webFillet:
Web Fillet - fillet radius between web and flange.
flangeFillet:
Flange Fillet - fillet radius at the flange end.
topWebFillet:
Top Web Fillet - fillet radius at the top of web.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
Defines parameters for Angle structural section.
Since:
2018